In [2]:
import pandas as pd
df = pd.read_csv("Marks_data.csv")

In [3]:
df.head() #To check the first five rows

   student_id      Name  Math  Science  English  Total               Grade
0           1      Ford    13       32       55    239  local area network
1           2  Dennison    59       22       72    197         Ameliorated
2           3    Mandel    13       97       70    282      bi-directional
3           4   Camella    72       41       57    126            tertiary
4           5   Felicia    81       28       62    237           Proactive

In [4]:
df.isna() #Check null value

    student_id   Name   Math  Science  English  Total  Grade
0        False  False  False    False    False  False  False
1        False  False  False    False    False  False  False
2        False  False  False    False    False  False  False
3        False  False  False    False    False  False  False
4        False  False  False    False    False  False  False
..         ...    ...    ...      ...      ...    ...    ...
95       False  False  False    False    False  False  False
96       False  False  False    False    False  False  False
97       False  False  False    False    False  False  False
98       False  False  False    False    False  False  False
99       False  False  False    False    False  False  False

[100 rows x 7 columns]

In [5]:
df['Total'] = df[["Math", "Science", "English"]].sum(axis = 1)
print(df[["Name" ,"Math", "Science", "English", "Total"]])

    Math  Science  English
0     13       32       55
1     59       22       72
2     13       97       70
3     72       41       57
4     81       28       62
..   ...      ...      ...
95    23       18       41
96    21       80       24
97    41       53       45
98    41       97      100
99    58       58       70

[100 rows x 3 columns]

In [6]:
def assign_grade(total):
    if total >= 250:
        return 'A'
    elif total >= 200:
        return 'B'
    elif total >= 150:
        return 'C'
    else:
        return 'D'

In [7]:
df["Grade"] = df["Total"].apply(assign_grade)

In [9]:
print(df[["Name", "Total", "Grade"]])

         Name  Total Grade
0        Ford    100     D
1    Dennison    153     C
2      Mandel    180     C
3     Camella    170     C
4     Felicia    171     C
..        ...    ...   ...
95      Onfre     82     D
96     Jarrad    125     D
97     Michal    139     D
98  Engelbert    238     B
99     Jo ann    186     C

[100 rows x 3 columns]

In [11]:
print(df[["Name", "Total", "Grade"]].head())

       Name  Total Grade
0      Ford    100     D
1  Dennison    153     C
2    Mandel    180     C
3   Camella    170     C
4   Felicia    171     C

In [12]:
print(df[["Name", "Total", "Grade"]].tail())

         Name  Total Grade
95      Onfre     82     D
96     Jarrad    125     D
97     Michal    139     D
98  Engelbert    238     B
99     Jo ann    186     C

In [13]:
grade_a_students = df[df["Grade"] == 'A']

In [14]:
print(grade_a_students)

    student_id        Name  Math  Science  English  Total Grade
13          14    Raphaela    93       92       81    266     A
17          18    Faustine    91      100       82    273     A
57          58  Christiana    80       81       99    260     A

In [15]:
grade_b_students = df[df["Grade"] == 'B']
print(grade_b_students)

    student_id       Name  Math  Science  English  Total Grade
11          12       Aile    58       85       96    239     B
19          20    Kristen    96       50       83    229     B
22          23     Elinor    80       57       66    203     B
23          24       Arda    77       31       96    204     B
41          42    Rodolfo    93       92       56    241     B
43          44    Sawyere    99       82       49    230     B
44          45      Leigh    62       65       87    214     B
54          55     Donall    96       90       50    236     B
59          60     Alicia    68       88       89    245     B
60          61      Jorry    58       99       90    247     B
61          62    Ernesta   100       42       95    237     B
62          63       Shea    80       87       52    219     B
79          80      Madge    83       46       72    201     B
80          81       Dean    65       88       94    247     B
98          99  Engelbert    41       97      100    238     B

In [18]:
grade_c_students = df[df["Grade"] == 'C']
print(len(grade_c_students))

30

In [19]:
grade_d_students = df[df["Grade"] == 'D']
print(len(grade_d_students))

52

In [22]:
print("Total number of students failed:", len(df[df["Grade"] == 'D']))

Total number of students failed: 52

In [23]:
#max marks in math
math_max = max(df['Math'])
print(math_max)

100

In [25]:
#max marks in math
math_max = max(df['Math'])
print(math_max)

    student_id     Name  Math  Science  English  Total Grade
61          62  Ernesta   100       42       95    237     B

In [28]:
#To save the total value in the new csv file
df.to_csv("data_new.csv", index = False)
print("File created successfully")

File created successfully

In [29]:
pip install numpy

Requirement already satisfied: numpy in c:\users\k.nisarga\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip